bases/WIM_FIn/projects/IMAPPS-36274 Возможность настройки запуска регламентных операций по фильтру без РДУ/FP/DataProcessors/ГрупповоеВыполнениеЗакрытияПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ГрупповоеВыполнениеЗакрытияПериодов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаЗакрытияПортфелейПоРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиЗакрытияПортфелейПоРасписанию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписокПортфелей</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипыКлиентов</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Стратегии</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bases/WIM_FIn/projects/IMAPPS-36274 Возможность настройки запуска регламентных операций по фильтру без РДУ/FP/DataProcessors/ГрупповоеВыполнениеЗакрытияПериодов/Ext/ObjectModule.bsl
&Вместо("ЗаполнитьРеквизитыПоНастройкеРегулярногоЗакрытия")
Процедура fp_ЗаполнитьРеквизитыПоНастройкеРегулярногоЗакрытия(НастройкаРегулярногоЗакрытия)
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаЗапуска) Тогда
		ЭтотОбъект.ДатаЗапуска = ТекущаяДатаСеанса();
	КонецЕсли; 
	
	ЭтотОбъект.ПоВсемДействующимПортфелям = НастройкаРегулярногоЗакрытия.ПоВсемДействующимПортфелям;
	ЭтотОбъект.ВариантПериодаЗакрытия = НастройкаРегулярногоЗакрытия.ВариантДатыНачалаПериода;		
	ЭтотОбъект.ТипыКлиентов.Загрузить(НастройкаРегулярногоЗакрытия.ТипыКлиентов.Выгрузить());
	ЭтотОбъект.Стратегии.Загрузить(НастройкаРегулярногоЗакрытия.Стратегии.Выгрузить());
	ЭтотОбъект.СписокПортфелей.ЗагрузитьЗначения(НастройкаРегулярногоЗакрытия.НастройкиЗакрытияПериода.ВыгрузитьКолонку("Портфель"));
	ЭтотОбъект.СоздаватьОбщиеОперации = НастройкаРегулярногоЗакрытия.СоздаватьОбщиеОперации;		
	ЭтотОбъект.НастройкаЗакрытияПортфелейПоРасписанию = НастройкаРегулярногоЗакрытия; // IMAPPS-36274
	ВариантНастройкиПериодовРасписания = ВариантНастройкиПериодовРасписания(НастройкаРегулярногоЗакрытия);
	
	НачалоПериодаСмещается = ВариантНастройкиПериодовРасписания = ВариантыНастроекПериодовРасписания().ДНС_ДКР
		ИЛИ ВариантНастройкиПериодовРасписания = ВариантыНастроекПериодовРасписания().ДНС_ДКС;
	
	Если НачалоПериодаСмещается Тогда			
		Если НастройкаРегулярногоЗакрытия.СмещениеДатыЗакрытияВРабочихДнях Тогда
			ЭтотОбъект.НачалоПериода = КалендарныеГрафики.ПолучитьСледующуюРабочуюДату(Неопределено, ЭтотОбъект.ДатаЗапуска, НастройкаРегулярногоЗакрытия.СмещениеДатыЗакрытия);
		Иначе	
			ЭтотОбъект.НачалоПериода = ОбщегоНазначенияДУ.ДобавитьДень(ЭтотОбъект.ДатаЗапуска, НастройкаРегулярногоЗакрытия.СмещениеДатыЗакрытия);
		КонецЕсли;		
	КонецЕсли;
	
	КонецПериодаСмещается =  ВариантНастройкиПериодовРасписания = ВариантыНастроекПериодовРасписания().ДНС_ДКС
		ИЛИ ВариантНастройкиПериодовРасписания = ВариантыНастроекПериодовРасписания().ДНГ_ДКС;
	
	Если КонецПериодаСмещается Тогда		
		Если НастройкаРегулярногоЗакрытия.СмещениеДатыОкончанияЗакрытияВРабочихДнях Тогда
			ЭтотОбъект.КонецПериода = КалендарныеГрафики.ПолучитьСледующуюРабочуюДату(Неопределено, ЭтотОбъект.ДатаЗапуска, НастройкаРегулярногоЗакрытия.СмещениеДатыОкончанияЗакрытия);
		Иначе	
			ЭтотОбъект.КонецПериода = ОбщегоНазначенияДУ.ДобавитьДень(ЭтотОбъект.ДатаЗапуска, НастройкаРегулярногоЗакрытия.СмещениеДатыОкончанияЗакрытия);
		КонецЕсли;			
	КонецЕсли;	
	
	Если ВариантНастройкиПериодовРасписания = ВариантыНастроекПериодовРасписания().ДНС_ДКР Тогда
		ЭтотОбъект.КонецПериода = ЭтотОбъект.НачалоПериода;
		
	КонецЕсли; 
		
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьПериодыПортфелейПоГраницам")
Процедура fp_ЗаполнитьПериодыПортфелейПоГраницам()

	Если Не ЗначениеЗаполнено(КонецПериода) Тогда
		Возврат;
	КонецЕсли;		

	РезультатЗапроса = ЗапросПоГраницам();	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;		
	КонецЕсли; 

	ТипыКлиентовДУ = ВыбранныеТипыКлиентовДУ();
	СтратегииДУ = ВыбранныеСтратегии();

	ВыборкаГраницаАктуальности = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
	ВыборкаГраницаАктуальности.Следующий();
	СамаяРанняяГраницаПоследовательности = ВыборкаГраницаАктуальности.ГраницаАктуальности;
	ВыборкаГраницаАктуальности.Сбросить();

	ПортфелиГраницы = Новый Массив;	
	Сутки = 86400;	
	КоличествоДней = (ЭтотОбъект.КонецПериода - СамаяРанняяГраницаПоследовательности) / Сутки;
	Для Индекс = 1 По КоличествоДней Цикл

		День = СамаяРанняяГраницаПоследовательности + Сутки * Индекс;	

		Если ЭтотОбъект.ПоВсемДействующимПортфелям Тогда
			СписокПортфелейПоСтратегиям = СписокПортфелейПоСтратегиям(СтратегииДУ, День);
			ДействующиеПортфели = Справочники.Портфели.ДействующиеПортфели(День, ТипыКлиентовДУ, СписокПортфелейПоСтратегиям);
			#Вставка
			ДействующиеПортфели = Справочники.Портфели.ПолучитьПортфелиПоОтборуСКД(НастройкаЗакрытияПортфелейПоРасписанию, ДействующиеПортфели);
			#КонецВставки
		КонецЕсли; 		

		Поиск = Новый Структура("ГраницаАктуальности", День - Сутки);
		Если ВыборкаГраницаАктуальности.НайтиСледующий(Поиск) Тогда
			Выборка = ВыборкаГраницаАктуальности.Выбрать();
			Пока Выборка.Следующий() Цикл
				ПортфелиГраницы.Добавить(Выборка.Портфель);				
			КонецЦикла; 			
		КонецЕсли; 

		Для каждого Портфель Из ПортфелиГраницы Цикл			
			Если ЭтотОбъект.ПоВсемДействующимПортфелям Тогда
				ЭтоДействующийПортфель = ДействующиеПортфели.Найти(Портфель) <> Неопределено;
				Если НЕ ЭтоДействующийПортфель Тогда
					Продолжить;				
				КонецЕсли;				
			КонецЕсли; 
			НовыйПериод = ЭтотОбъект.ПериодыПортфелей.Добавить();
			НовыйПериод.Портфель = Портфель;
			НовыйПериод.День = День;
		КонецЦикла; 

	КонецЦикла;			

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьПериодыПортфелейПоВарианту_ДНГ_ДКР")
Процедура fp_ЗаполнитьПериодыПортфелейПоВарианту_ДНГ_ДКР()

	РезультатЗапроса = ЗапросПоГраницам();	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;		
	КонецЕсли; 

	ТипыКлиентовДУ = ВыбранныеТипыКлиентовДУ();
	СтратегииДУ = ВыбранныеСтратегии();

	ВыборкаГраницаАктуальности = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГраницаАктуальности.Следующий() Цикл

		День = ВыборкаГраницаАктуальности.ГраницаАктуальности;
		Если ЭтотОбъект.ПоВсемДействующимПортфелям Тогда
			СписокПортфелейПоСтратегиям = СписокПортфелейПоСтратегиям(СтратегииДУ, День);
			ДействующиеПортфели = Справочники.Портфели.ДействующиеПортфели(День, ТипыКлиентовДУ, СписокПортфелейПоСтратегиям);
			#Вставка
			ДействующиеПортфели = Справочники.Портфели.ПолучитьПортфелиПоОтборуСКД(НастройкаЗакрытияПортфелейПоРасписанию, ДействующиеПортфели);
			#КонецВставки
		КонецЕсли;		

		Выборка = ВыборкаГраницаАктуальности.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЭтотОбъект.ПоВсемДействующимПортфелям Тогда
				ЭтоДействующийПортфель = ДействующиеПортфели.Найти(Выборка.Портфель) <> Неопределено;				
				Если НЕ ЭтоДействующийПортфель Тогда
					Продолжить;				
				КонецЕсли;				
			КонецЕсли; 

			НовыйПериод = ЭтотОбъект.ПериодыПортфелей.Добавить();
			НовыйПериод.Портфель = Выборка.Портфель;
			НовыйПериод.День = День;
		КонецЦикла; 	

	КонецЦикла; 		

КонецПроцедуры

&Вместо("ЗаполнитьСписокПортфелей")
Процедура fp_ЗаполнитьСписокПортфелей(ДатаЗакрытия, СписокТипов = Неопределено, СписокПортфелейПоСтратегиям = Неопределено) Экспорт
	
	СписокПортфелей.Очистить();
	
	Если СписокТипов = Неопределено Тогда
		СписокТипов = ТипыКлиентов.ВыгрузитьКолонку("ТипКлиента");
	КонецЕсли;
	
	Если СписокПортфелейПоСтратегиям = Неопределено Тогда
		СписокСтратегий = Стратегии.ВыгрузитьКолонку("Стратегия");
		Если СписокСтратегий.Количество() <> 0 Тогда
			СписокПортфелейПоСтратегиям = СписокПортфелейПоСтратегиям(СписокСтратегий, ДатаЗакрытия);
		КонецЕсли;
	КонецЕсли;
	
	ДействующиеПортфели = Справочники.Портфели.ДействующиеПортфели(ДатаЗакрытия, СписокТипов, СписокПортфелейПоСтратегиям);
	//#Вставка
	ДействующиеПортфели = Справочники.Портфели.ПолучитьПортфелиПоОтборуСКД(НастройкаЗакрытияПортфелейПоРасписанию, ДействующиеПортфели);
	//#КонецВставки
	ОбщегоНазначенияДУ.ДобавитьВЛогОтладки(ДействующиеПортфели, "Обработка.ГрупповоеВыполнениеЗакрытияПериодов.ЗаполнитьСписокПортфелей()");
	
	Если ЗначениеЗаполнено(ДействующиеПортфели) Тогда
		Для Каждого ПортфельСсылка Из ДействующиеПортфели Цикл			
			СписокПортфелей.Добавить(ПортфельСсылка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
